{
    "strive": {
        "historiTitle": "Hialo",
        "histori1": "It all started with a personal reflection: how could I convey the emotion I felt when driving for the first time and the contrast with the following years, where an oppressive work environment and a too 'normal' car made me lose that spark? I wanted to create something that spoke of authenticity, of not letting the system extinguish you, and at the same time connected with my passion for JDM culture, streetwear, and automotive tuning.",
        "histori2": "From that restlessness was born STRV (Strive), an initial concept that sought to reflect the idea of fighting for your dreams. However, the project evolved into HASHIRI CO., a stronger name that directly connects with movement and speed: 'Hashiri' in Japanese means 'to run' or 'race'. Without a budget to hire a designer, I decided to build the brand identity using my own resources: typographic design, digital collage, and accessible tools like Figma and Canva.",
        "problemTitle": "Problem / Opportunity",
        "problem1": "Budget gap: It was not feasible to turn to an external studio.",
        "problem2": "Personal narrative: Translating my life experiences into a coherent visual discourse.",
        "problem3": "Limited time: The need to move forward with a clear and organized strategy.",
        "objetiveTitle": "Objectives",
        "objetive1": "Define a solid brand name and direction.",
        "objetive2": "Design a logo, color palette, and typography that conveyed rebellion and movement.",
        "objetive3": "Create sticker prototypes and garment mockups.",
        "objetive4": "Document the entire process as a case study for my portfolio.",
        "researchTitle": "Research and Discovery",
        "research1": "The process began with a comparative analysis of brands like BAPE, Supreme, and Hoonigan, which allowed me to identify how they build powerful and memorable visual narratives. From there, I developed moodboards combining the nocturnal aesthetic of JDM culture (city lights, car silhouettes, metallic reflections) with urban elements like graffiti and bold typography.",
        "research2": "To complement this phase, I conducted informal interviews with tuning enthusiasts and skaters, which helped me understand which emotional values resonated most with them:<1> authenticity, rebellion, and belonging to a community.</1>",
        "definitionTitle": "Brand Definition",
        "definition1": "The first iteration of the project was called STRV, inspired by the English word Strive (effort). However, as the research progressed, I noticed that the word conveyed struggle but not necessarily movement. After several user tests, I chose HASHIRI CO., a name that in Japanese means “to run” or “race”, and better reflected the essence of speed and freedom associated with JDM.",
        "definition2": "The chosen slogan was “Off the Loop”, a manifesto against routine and social pressure that invites reconnecting with the thrill of driving. Together, the brand values were defined as authenticity, rebellion, and rediscovery, with a positioning focused on premium limited edition clothing and stickers.",
        "designTitle": "Visual Identity Design",
        "design1": "To shape this identity, I worked on a logo based on bold sans typography with ligatures inspired by the steering wheel and piston, aiming to convey dynamism even in a typographic element. The color palette was defined with three main tones: racing red, charcoal black, and metallic gray, colors that evoke both the automotive world and urban aesthetics.",
        "design2": "The application of the identity materialized in stickers with circuit data collages, as well as caps and t-shirts with minimalist typography, designed to work both in street contexts and car meets.",
        "testingTitle": "Prototyping and Testing",
        "testing1": "Prototype development was carried out in Figma, creating reusable components to simulate products and build realistic mockups. At the same time, I used Canva to make quick collages aimed at social media and visual communication moodboards.",
        "testing2": "I shared these first proposals in online communities of JDM enthusiasts, which generated valuable feedback: necessary adjustments in contrast and legibility stood out, aspects that were incorporated to improve brand coherence.",
        "performanceTitle": "Simplification and Efficiency",
        "performance1": "Lightweight branding system: color tokens and typography in Figma.",
        "performance2": "Process documentation in Notion to maintain clarity and organization.",
        "resultsTitle": "Partial Results",
        "results1": "Final chosen name: HASHIRI CO.",
        "results2": "Visual identity kit completed.",
        "results3": "Initial series of conceptual stickers and 3 garment mockups.",
        "results4": "Visual logbook with snapshots of the creative process.",
        "lessonTitle": "Lessons Learned",
        "lesson1": "Resource limitations drive creativity: digital collage and typography became key expressive tools.",
        "lesson2": "Early community involvement avoids costly mistakes and redesigns.",
        "lesson3": "Documenting not only the outcome but also failures and learnings adds more weight to the case study.",
        "nextTitle": "Next Steps",
        "next1": "Physical production: Stickers and first garments in small scale.",
        "next2": "Soft launch: Limited online sale to test acceptance.",
        "next3": "Measurement: Observe conversion and engagement metrics.",
        "next4": "Collaborations: Explore partnerships with workshops and car meet events.",
        "footerText": "<0>HASHIRI CO.</0> was born from a personal story and established itself as a visual manifesto of authenticity and rebellion. This case study demonstrates my ability to turn life experiences into a tangible design project, aligned with Product Design methodology."
    }
}